zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_jh/pic32cm_jh01/atdf/PIC32CM1216JH01032.atdf
        <register name="STATUSB" offset="0x38" rw="R" size="4" initval="0x00000002" caption="Peripheral write protection status - Bridge B">
          <bitfield name="PORT_" caption="PORT APB Protect Enable" mask="0x1"/>
          <bitfield name="DSU_" caption="DSU APB Protect Enable" mask="0x2"/>
          <bitfield name="NVMCTRL_" caption="NVMCTRL APB Protect Enable" mask="0x4"/>
          <bitfield name="DMAC_" caption="DMAC APB Protect Enable" mask="0x8"/>
          <bitfield name="MTB_" caption="MTB APB Protect Enable" mask="0x10"/>
          <bitfield name="HMATRIXHS_" caption="HMATRIXHS APB Protect Enable" mask="0x20"/>
        </register>
        <register name="STATUSC" offset="0x3C" rw="R" size="4" initval="0x09000000" caption="Peripheral write protection status - Bridge C">
          <bitfield name="EVSYS_" caption="EVSYS APB Protect Enable" mask="0x1"/>
          <bitfield name="SERCOM0_" caption="SERCOM0 APB Protect Enable" mask="0x2"/>
          <bitfield name="SERCOM1_" caption="SERCOM1 APB Protect Enable" mask="0x4"/>
          <bitfield name="SERCOM2_" caption="SERCOM2 APB Protect Enable" mask="0x8"/>
          <bitfield name="SERCOM3_" caption="SERCOM3 APB Protect Enable" mask="0x10"/>
          <bitfield name="CAN0_" caption="CAN0 APB Protect Enable" mask="0x80"/>
          <bitfield name="TC0_" caption="TC0 APB Protect Enable" mask="0x1000"/>
          <bitfield name="TC1_" caption="TC1 APB Protect Enable" mask="0x2000"/>
          <bitfield name="TC2_" caption="TC2 APB Protect Enable" mask="0x4000"/>
          <bitfield name="TC3_" caption="TC3 APB Protect Enable" mask="0x8000"/>
          <bitfield name="TC4_" caption="TC4 APB Protect Enable" mask="0x10000"/>
          <bitfield name="ADC0_" caption="ADC0 APB Protect Enable" mask="0x20000"/>
          <bitfield name="AC_" caption="AC APB Protect Enable" mask="0x80000"/>
          <bitfield name="SMBIST_" caption="SMBIST APB Protect Enable" mask="0x8000000"/>
        </register>
      </register-group>
      <value-group name="PAC_WRCTRL__KEY">
        <value name="OFF" caption="No action" value="0"/>
        <value name="CLR" caption="Clear protection" value="1"/>
        <value name="SET" caption="Set protection" value="2"/>
        <value name="SETLCK" caption="Set and lock protection" value="3"/>
      </value-group>
    </module>
    <module name="PM" id="U2240" version="2.1.1" caption="Power Manager">
      <register-group name="PM" caption="Power Manager">
        <register name="SLEEPCFG" offset="0x1" rw="RW" size="1" initval="0x00" caption="Sleep Configuration">
          <bitfield name="SLEEPMODE" caption="Sleep Mode" mask="0x7" values="PM_SLEEPCFG__SLEEPMODE"/>
        </register>
        <register name="STDBYCFG" offset="0x8" rw="RW" size="2" initval="0x0400" caption="Standby Configuration">
          <bitfield name="VREGSMOD" caption="Voltage Regulator Standby mode" mask="0xC0" values="PM_STDBYCFG__VREGSMOD"/>
          <bitfield name="BBIASHS" caption="Back Bias for SRAM" mask="0x400"/>
        </register>
      </register-group>
      <value-group name="PM_SLEEPCFG__SLEEPMODE">
        <value name="IDLE0" caption="CPU clock is OFF. AHB/APB clocks are provided to CAN and to IPs requesting them" value="0"/>
        <value name="IDLE2" caption="CPU clock is OFF. AHB/APB clocks are provided to IPs requesting them (CAN excluded)" value="2"/>
        <value name="STANDBY" caption="CPU clock is OFF. AHB/APB clocks are stopped except if requested" value="4"/>
      </value-group>
      <value-group name="PM_STDBYCFG__VREGSMOD">
        <value name="AUTO" caption="Automatic mode" value="0"/>
        <value name="PERFORMANCE" caption="Performance oriented" value="1"/>
        <value name="LP" caption="Low Power oriented" value="2"/>
      </value-group>
    </module>
    <module name="PORT" id="U2210" version="3.1.0" caption="Port Module">
      <register-group name="GROUP" size="0x80">
        <register name="DIR" offset="0x0" rw="RW" size="4" initval="0x00000000" caption="Data Direction">
          <bitfield name="DIR" caption="Port Data Direction" mask="0xFFFFFFFF"/>
        </register>
        <register name="DIRCLR" offset="0x4" rw="RW" size="4" atomic-op="clear:DIR" initval="0x00000000" caption="Data Direction Clear">
          <bitfield name="DIRCLR" caption="Port Data Direction Clear" mask="0xFFFFFFFF"/>
        </register>
        <register name="DIRSET" offset="0x8" rw="RW" size="4" atomic-op="set:DIR" initval="0x00000000" caption="Data Direction Set">
          <bitfield name="DIRSET" caption="Port Data Direction Set" mask="0xFFFFFFFF"/>
        </register>
        <register name="DIRTGL" offset="0xC" rw="RW" size="4" atomic-op="toggle:DIR" initval="0x00000000" caption="Data Direction Toggle">
          <bitfield name="DIRTGL" caption="Port Data Direction Toggle" mask="0xFFFFFFFF"/>
        </register>
        <register name="OUT" offset="0x10" rw="RW" size="4" initval="0x00000000" caption="Data Output Value">
          <bitfield name="OUT" caption="PORT Data Output Value" mask="0xFFFFFFFF"/>
        </register>
        <register name="OUTCLR" offset="0x14" rw="RW" size="4" atomic-op="clear:OUT" initval="0x00000000" caption="Data Output Value Clear">
          <bitfield name="OUTCLR" caption="PORT Data Output Value Clear" mask="0xFFFFFFFF"/>
        </register>
        <register name="OUTSET" offset="0x18" rw="RW" size="4" atomic-op="set:OUT" initval="0x00000000" caption="Data Output Value Set">
          <bitfield name="OUTSET" caption="PORT Data Output Value Set" mask="0xFFFFFFFF"/>
        </register>
        <register name="OUTTGL" offset="0x1C" rw="RW" size="4" atomic-op="toggle:OUT" initval="0x00000000" caption="Data Output Value Toggle">
          <bitfield name="OUTTGL" caption="PORT Data Output Value Toggle" mask="0xFFFFFFFF"/>
        </register>
        <register name="IN" offset="0x20" rw="R" size="4" initval="0x00000000" caption="Data Input Value">
          <bitfield name="IN" caption="PORT Data Input Value" mask="0xFFFFFFFF"/>
        </register>
        <register name="CTRL" offset="0x24" rw="RW" size="4" initval="0x00000000" caption="Control">
          <bitfield name="SAMPLING" caption="Input Sampling Mode" mask="0xFFFFFFFF"/>
        </register>
